[{"name": "Block", "content": "(General) A player with the Block skill is proficient at knocking opponents down. The Block skill, if used, affects the results rolled with the Block dice, as explained in the Blocking rules. "}, {"name": "Dauntless", "content": "(General) A player with this skill is capable of psyching himself up so he can take on even the very strongest opponent. The skill only works when the player attempts to block an opponent who is stronger than himself. When the skill is used, the coach of the player with the Dauntless skill rolls a D6 and adds it to his strength. If the total is equal to or lower than the opponent’s Strength, the player must block using his normal Strength. If the total is greater, then the player with the Dauntless skill counts as having a Strength equal to his opponent’s when he makes the block. The strength of both players is calculated before any defensive or offensive assists are added but after all other modifiers. FAQQ: When a player with the Dauntless skill declares a Block action, can they choose to not perform the Block action if they do not roll the desired result for the Dauntless skill? (p.76)A: No, they must still perform the Block action. "}, {"name": "Dirty Player", "content": "(General) A player with this skill has trained long and hard to learn every dirty trick in the book. Add 1 to any Armour roll or Injury roll made by a player with this skill when they make a Foul as part of a Foul Action. Note that you may only modify one of the dice rolls, so if you decide to use Dirty Player to modify the Armour roll, you may not modify the Injury roll as well. "}, {"name": "Fend", "content": "(General) This player is very skilled at holding off would-be attackers. Opposing players may not follow-up blocks made against this player even if the Fend player is Knocked Down. The opposing player may still continue moving after blocking if he had declared a Blitz Action. "}, {"name": "Frenzy", "content": "(General) A player with this skill is a slavering psychopath who attacks his opponents in an uncontrollable rage. Unless otherwise overridden, this skill must always be used. When making a block, a player with this skill must always follow up if he can. If a ‘Pushed’ or ‘Defender Stumbles’ result was chosen, the player must immediately throw a second block against the same opponent so long as they are both still standing and adjacent. If possible, the player must also follow up this second block. If the frenzied player is performing a Blitz Action then he must pay a square of Movement and must make the second block unless he has no further normal movement and cannot Go For It again. FAQQ: If a player with the Frenzy skill performs a Block action against a Rooted player and rolls a Push Back, does the player with Frenzy still get to perform a second Block even though the Rooted player cannot be pushed back?A: Yes. "}, {"name": "Kick", "content": "(General) The player is an expert at kicking the ball and can place the kick with great precision. In order to use this skill the player must be set up on the pitch when his team kicks off. The player may not be set up in either wide zone or on the line of scrimmage. Only if all these conditions are met is the player then allowed to take the kick-off. Because his kick is so accurate, you may choose to halve the number of squares that the ball scatters on kick-off, rounding any fractions down (i.e., 1 = 0, 2-3 = 1, 4- 5 = 2, 6 = 3). "}, {"name": "Kick-Off Return", "content": "(General) A player on the receiving team that is not on the Line of Scrimmage or in an opposing tackle zone may use this skill when the ball has been kicked. It allows the player to move up to 3 squares after the ball has been scattered but before rolling on the Kick-Off table. Only one player may use this skill each kick-off. This skill may not be used for a touchback kick-off and does not allow the player to cross into the opponent’s half of the pitch. "}, {"name": "Pass Block", "content": "(General) A player with this skill is allowed to move up to three squares when the opposing coach announces that one of his players is going to pass the ball (but not a bomb). The opposing coach may not change his mind about passing once Pass Block’s use is declared. The move is made out of sequence, after the range has been measured, but before any interception attempts have been made. A player may not make the move unless able to reach a legal destination and may not follow a route that would not allow them to reach a legal destination. A legal destination puts the player in a position to attempt an interception, an empty square that is the target of the pass, or with his tackle zone on the thrower or catcher. The player may not stop moving until he has reached a legal destination, has been held fast by Tentacles or has been Knocked Down. The special move is free, and in no way affects the player’s ability to move in a subsequent action. The move is made using all of the normal rules and skills (for example, having to dodge in order to leave opposing players’ tackle zones.) Players with Pass Block may use this skill against a Dump Off pass. If a player performing a Pass Block in their own turn is Knocked Down then this is a turnover, no other players may perform Pass Block moves, and your turn ends as soon as the results of the pass and the block are resolved. "}, {"name": "Pro", "content": "(General) A player with this skill is a hardened veteran. Such players are called professionals or Pros by other Blood Bowl players because they rarely make a mistake. Once per turn, a Pro is allowed to re-roll any one dice roll he has made other than Armour, Injury or Casualty, even if he is Prone or Stunned. However, before the re-roll may be made, his coach must roll a D6. On a roll of 4, 5 or 6 the re-roll may be made. On a roll of 1, 2 or 3 the original result stands and may not be re-rolled with a skill or team re-roll; however you can re-roll the Pro roll with a Team re-roll. FAQQ: Can a player with the Pro skill use the re-roll outside of their activation – for example, to Catch or Intercept the ball? (p.77)A: No. The Pro skill can only be used during that player’s activation.Q: If a player has both the Pro and Brawler skills, can they re-roll a single Both Down result for the Brawler skill, and then use the Pro skill to attempt to re-roll another dice from the same dice pool? (p.77 & 80)A: Yes, so long as the same dice isn’t re-rolled more than once.Q: A player with both the Pro skill and Brawler skill performs Block, rolls two Block Dice and rolls Both Down on both dice, can the controlling coach choose to use Brawler on one of the dice, and then subsequently attempt to use Pro on the other dice that has not yet been rerolled? (p.77 & 80)A: Yes, so long as the same dice is not re-rolled more than once. "}, {"name": "Shadowing", "content": "(General) The player may use this skill when a player performing an Action on the opposing team moves out of any of his tackle zones for any reason. The opposing coach rolls 2D6 adding his own player’s movement allowance and subtracting the Shadowing player’s movement allowance from the score. If the final result is 7 or less, the player with Shadowing may move into the square vacated by the opposing player. He does not have to make any Dodge rolls when he makes this move, and it has no effect on his own movement in his own turn. If the final result is 8 or more, the opposing player successfully avoids the Shadowing player and the Shadowing player may not move into the vacated square. A player may make any number of shadowing moves per turn. If a player has left the tackle zone of several players that have the Shadowing skill, then only one of the opposing players may attempt to shadow him. FAQQ: If a player attempts to Dodge away from a player with the Shadowing skill, which roll happens first: the Dodge roll or the roll for Shadowing? (p.77)A: The Dodge roll will happen first, and once the Dodge has been resolved the opposing player may roll for Shadowing if they wish. "}, {"name": "Strip Ball", "content": "(General) When a player with this skill blocks an opponent with the ball, applying a !Pushed’ or !Defender Stumbles’ result will cause the opposing player to drop the ball in the square that they are pushed to, even if the opposing player is not Knocked Down. FAQQ: If a player with the Strip Ball skill rolls a Push Back result against a player who is holding the ball, and that player is pushed into the End Zone, do they score a touchdown as described on page 64? (p.77)A: No. "}, {"name": "Sure Hands", "content": "(General) A player with the Sure Hands skill is allowed to re-roll the D6 if he fails to pick up the ball. In addition, the Strip Ball skill will not work against a player with this skill. "}, {"name": "Tackle", "content": "(General) Opposing players who are standing in any of this player’s tackle zones are not allowed to use their Dodge skill if they attempt to dodge out of any of the player’s tackle zones, nor may they use their Dodge skill if the player throws a block at them and uses the Tackle skill. "}, {"name": "Wrestle", "content": "(General) The player is specially trained in grappling techniques. This player may use Wrestle when he blocks or is blocked and a !Both Down’ result on the Block dice is chosen by either coach. Instead of applying the ‘Both Down’ result, both players are wrestled to the ground. Both players are Placed Prone in their respective squares even if one or both have the Block skill. Do not make Armour rolls for either player. Use of this skill does not cause a turnover unless the active player was holding the ball.   AGILITY    (adsbygoogle=window.adsbygoogle||[]).push({}) "}, {"name": "Catch", "content": "(Agility) A player who has the Catch skill is allowed to re-roll the D6 if he fails a catch roll. It also allows the player to re-roll the D6 if he drops a hand-off or fails to make an interception. FAQQ: Can the Catch skill be used when attempting to catch a Bomb? (p.75)A: No, a Bomb is not a ball.Q: What happens if a player already has the Catch skill or the Monstrous Mouth skill and randomly rolls the other Skill? (p.75 & 78)A: If a player has the Monstrous Mouth skill and subsequently rolls the Catch skill, then they should re-roll. If a player has the Catch skill and subsequently rolls the Monstrous Mouth skill, then they may not re-roll, as the Monstrous Mouth skill provides an additional benefit. "}, {"name": "Defensive", "content": "(Agility) During your opponent’s team turn (but not during your own team), any opposition player being marked by this player cannot use the guard skill. "}, {"name": "Diving Catch", "content": "(Agility) The player is superb at diving to catch balls others cannot reach and jumping to more easily catch perfect passes. The player may add 1 to any catch roll from an accurate pass targeted to his square. In addition, the player can attempt to catch any pass, kick off or crowd throw-in, but not bouncing ball, that would land in an empty square in one of his tackle zones as if it had landed in his own square without leaving his current square. A failed catch will bounce from the Diving Catch player’s square. If there are two or more players attempting to use this skill then they get in each other’s way and neither can use it. FAQQ: What happens if the ball lands in the Tackle Zones of multiple players from the same team with the Diving Catch skill? (p.75)A: Each player may attempt to catch the ball, in an order chosen by the controlling coach.Q: What happens if the ball lands in the Tackle Zones of multiple players from opposing teams with the Diving Catch skill? (p.75)A: Each player may attempt to catch the ball, in an order chosen by the active team’s coach.Q: If a player with the Diving Catch skill attempts to catch the ball when it is landing in an adjacent square and fails, does the ball bounce from the player who failed the catch, or from where it was going to initially land? (p.75)A: The ball will bounce from where it was initially going to land. "}, {"name": "Diving Tackle", "content": "(Agility) The player may use this skill after an opposing player attempts to dodge out of any of his tackle zones. The opposing player must subtract 2 from his Dodge roll for leaving the player’s tackle zone. If a player is attempting to leave the tackle zone of several players that have the Diving Tackle skill, then only one of the opposing players may use Diving Tackle. Diving Tackle may be used on a re-rolled dodge if not declared for use on the first Dodge roll. Once the dodge is resolved but before any armour roll for the opponent (if needed), the Diving Tackle Player is Placed Prone in the square vacated by the dodging player but do not make an Armour or Injury roll for the Diving Tackle player. FAQQ: If a player attempts to Dodge away from a player with the Diving Tackle skill and fails the original Dodge roll, but then uses a re-roll and succeeds, can the player with Diving Tackle use this Skill on the re-rolled attempt? (p.75)A: Yes "}, {"name": "Dodge", "content": "(Agility) A player with the Dodge skill is adept at slipping away from opponents, and is allowed to re-roll the D6 if he fails to dodge out of any of an opposing player’s tackle zones. However, the player may only re-roll one failed Dodge roll per turn. In addition, the Dodge skill, if used, affects the results rolled on the Block dice, as explained in the Blocking rules. FAQQ. Can the Dodge skill be used on moves outside of a player’s activation, such as those provided from On the Ball, or the Blitz result on the Kick-off Event table? (p.75)A: No. The Dodge skill can only be used to re-roll a Dodge roll during that player’s activation during their own team turn. "}, {"name": "Jump Up", "content": "(Agility) A player with this skill is able to quickly get back into the game. If the player declares any Action other than a Block Action he may stand up for free without paying the three squares of movement. The player may also declare a Block Action while Prone which requires an Agility roll with a +2 modifier to see if he can complete the Action. A successful roll means the player can stand up for free and block an adjacent opponent. A failed roll means the Block Action is wasted and the player may not stand up. FAQQ: Does a player who has the Jump Up skill still need to roll to stand up if they also have a Movement Allowance of 2 or less? (p.44 & 75)A: No.Q: If a player with the Animal Savagery trait also has the Jump Up skill, do they still get the +2 to the roll if they wish to attempt to make a Block action while prone? (p.75 & 81)A: Yes.Q: If a player has both the Jump Up skill and the Stab trait, can they use the Jump Up skill to allow them to make a Block action from Prone on a 2 + and then replace this Block action with a Stab Special action? (p.75 & 86)A: Yes. "}, {"name": "Leap", "content": "(Agility) A player with the Leap skill is allowed to jump to any empty square within 2 squares even if it requires jumping over a player from either team. Making a leap costs the player two squares of movement. In order to make the leap, move the player to any empty square 1 to 2 squares from his current square and then make an Agility roll for the player. No modifiers apply to this D6 roll unless he has Very Long Legs. The player does not have to dodge to leave the square he starts in. If the player successfully makes the D6 roll then he makes a perfect jump and may carry on moving. If the player fails the Agility roll then he is Knocked Down in the square that he was leaping to, and the opposing coach makes an Armour roll to see if he was injured. A player may only use the Leap skill once per turn. FAQQ: If a player with the Leap skill or Pogo Stick trait has used all of their Movement Allowance and is attempting to use the Leap skill or Pogo Stick trait to jump over a square, what happens if they fail the Rush roll? (p.75 & 85)A: If the Rush fails, then the player will fall over in the square they have moved into, do not roll the Agility test for the jumping player. "}, {"name": "Safe Pair of Hands", "content": "(Agility) If this player is Knocked Down or Placed Prone (but not it they Fall Over) whilst in possession of the ball, the ball does not bounce. Instead, you may place the ball in an unoccupied square adjacent to the one this player occupies when they become Prone. This Skill may still be used if the player is Prone. FAQQ: If a player with the Safe Pair of Hands skill is targeted by a Block action performed by a player with the Strip Ball skill, and they suffer a Push Back result, can they still use Safe Pair of Hands? (p.75)A: No.Q: If a player with the Safe Pair of Hands skill is Knocked Down, and there are no empty squares for them to put the ball into, what happens? (p.75)A: The Safe Pair of Hands skill cannot be used in this instance, and so the ball will bounce as normal. "}, {"name": "Sidestep", "content": "(Agility) If this player is pushed back for any reason, they are not moved into a square chosen by the opposing coach. Instead you may choose any unoccupied square adjacent to this player. This player is pushed back into that square instead. If there are no unoccupied squares adjacent to this player, this skill cannot be used. "}, {"name": "Sneaky Git", "content": "(Agility) During a Foul Action a player with this skill is not ejected for rolling natural doubles on the Armour roll. FAQQ: Can a player with the Sneaky Git skill that performs a Foul action still be Sent-off if it rolls a natural double on the Injury roll? (p.75)A: Yes. "}, {"name": "Sprint", "content": "(Agility) When this player performs any action that includes movement, they may attempt to Rush three times, rather than the usual two. "}, {"name": "Sure Feet", "content": "(Agility) Once per team turn, during their activation, this player may re-roll the D6 when attempting to Rush. FAQQ: Can the Sure Feet skill be used on moves outside of a player’s activation, such as those provided from the Blitz result on the Kick-off Event table? (p.75)A: No. The Sure Feet skill can only be used during that player’s activation.   PASSING    (adsbygoogle=window.adsbygoogle||[]).push({}) "}, {"name": "Accurate", "content": "(Passing) The player may add 1 to the D6 roll when he passes. "}, {"name": "Cannoneer", "content": "(Passing) When this player performs a Long Pass action or a Long Bomb Pass action, you may apply an additional +1 modifier to the Passing Ability test. FAQQ: Does the Cannoneer skill still apply when a player makes a Hail Mary Pass? (p.79)A: Yes. "}, {"name": "Cloud Burster", "content": "(Passing) When this player performs a Long Pass action or a Long Bomb Pass action, you may choose to make the opposing coach re-roll a successful attempt to interfere with the pass. "}, {"name": "Dump-Off", "content": "(Passing) If this player is nominated as the target of a Block action (or a Special action granted by a Skill or Trait that can be performed instead of a Block action) and if they are in possession of the ball, they may immediately perform a Quick Pass action, interrupting the activation of the opposition player performing the Block action (or Special action) to do so. This Quick Pass action cannot cause a Turnover, but otherwise all of the normal rules for passing the ball apply. Once the Quick Pass action is resolved, the active player performs the Block action and their team turn continues. FAQQ: When a player with the Dump-off skill is nominated as the target of a Blitz action, when do they make their Quick Pass action? (p.79)A: As soon as they are nominated as the target of the Blitz action.Q: Can a player with both the Dump-off and the Pass skills use the Pass skill when making a Pass action as part of the Dumpoff skill? (p.79)A: Yes.Q: Can a player with both the Bombardier trait and the Dumpoff skill use the Dump-off skill to perform a Throw Bomb Special action when they are chosen as the target of a Block Action? (p.79 & 83)A: No.Q: If a player with a Trait that requires them to roll a dice to see if they can activate normally (such as Bone Head or Unchanneled Fury) and wishes to declare a player with either the Foul Appearance or Dump-off skills as the target of an action, do they roll for their Trait or for the opposing player’s Skill first? (p.78 & 79)A: The player will first nominate the target of their action, then roll for their Trait, and then the opposing player will use their Skill. "}, {"name": "Fumblerooskie", "content": "(Passing) When this player performs a Move or Blitz action whilst in possession of the ball, they may choose to ‘drop’ the ball. The ball may be placed in any square the player vacates during their movement and does not bounce. No turnover is caused. "}, {"name": "Give and Go", "content": "(Passing) (Dungeon Bowl) If this player performs a Hand-off action, their activation does not have to end once the Hand-off is resolved. If you wish and if this player has not used their full Movement Allowance, they may continue to move after resolving the Hand-off. "}, {"name": "Hail Mary Pass", "content": "(Passing) The player may throw the ball to any square on the playing pitch, no matter what the range: the range ruler is not used. Roll a D6. On a roll of 1 the player fumbles the throw, and the ball will bounce once from the thrower’s square. On a roll of 2-6, the player may make the pass. The Hail Mary pass may not be intercepted, but it is never accurate – the ball automatically misses and scatters three squares. Note that if you are lucky, the ball will scatter back into the target square! This skill may not be used in a Blizzard or with the Throw Team-Mate skill. FAQQ: Is a Hail Mary Pass treated as a Long bomb when determining any modifiers for testing for accuracy? (p.79)A: Yes.Q: Does the Cannoneer skill still apply when a player makes a Hail Mary Pass? (p.79)A: Yes. "}, {"name": "Leader", "content": "(Passing) A team which has one or more players with this Skill gains a single extra team re-roll, However, the Leader re-roll can only be used if there is at least one player with this Skill on the pitch (even if the player with this Skill is Prone, Stunned or has lost their Tackle Zone). If all players with this Skill are removed from play before the Leader re-roll is used, is lost. The Leader Re-roll can be carried over into extra time if it is not used, but the team does not receive a new one at the start of extra time. Unlike standard Team Re-rolls, the Leader Re-roll cannot be lost due to a Halfling Master Chef. Otherwise, the Leader re-roll is treated just like a normal team re-roll. FAQQ: If a player with the Leader re-roll is removed from the pitch before their Leader re-roll has been used, then the re-roll would be lost. If the player would subsequently return to the pitch (such as recovering from being KO’d), is the re-roll available again? (p.79)A: Yes. "}, {"name": "Nerves of Steel", "content": "(Passing) The player ignores modifiers for enemy tackle zones when he attempts to pass, catch or intercept. "}, {"name": "On The Ball", "content": "(Passing) This player may move up to three squares (regardless their MA), following all of the normal movement rules, when the opposing coach declares that one of their player is going to perform a Pass action. This move is made after the range has been measured and the target square declared, but before the active player makes a Passing Ability test. Making this move interrupts the activation of the opposition player performing the Pass action. A player may use this Skill when an opposition player uses the Dump-Off skill, but should this player Fail Over whilst moving, a Turnover is caused. Additionally, during each Start of Drive sequence, after Step 2 but before Step 3, one Open player with this Skill on the receiving team may move up to three squares (regardless of their MA). This Skill may not be used if a touchback is caused when the kick deviates and does not allow the player to cross into their opponent’s half of the pitch. FAQQ: Can multiple players from the same team use the On The Ball skill in response to the same Pass action? If so, what happens if one of them Falls Over before the others have been able to use the On The Ball skill? (p.79)A: Yes. However, if one player Falls Over before the others have been able to use the On The Ball skill then the sequence ends and no further players can move. "}, {"name": "Pass", "content": "(Passing) A player with the Pass skill is allowed to re-roll the D6 if he throws an inaccurate pass or fumbles. "}, {"name": "Portal Passer", "content": "(Passing) (Dungeon Bowl) During its activation, when this player teleports using a Portal, it may declare a Pass action after determining which Portal it is teleporting to. This Skill may be used even if the player did not declare a Pass action at the beginning of their activation. "}, {"name": "Running Pass", "content": "(Passing) If this player performs a Quick Pass action, their activation does not have to end once the pass is resolved. If you wish and if this player has not used their full Movement Allowance, they may continue to move after resolving the pass. FAQQ: If a player with the Safe Pass skill and Running Pass skill fumbles a Pass action, does their activation end or can they make use of Running Pass? (p.79)A: Their activation will end. "}, {"name": "Safe Pass", "content": "(Passing) Should This player fumble a Pass Action, the ball is not dropped, does not bounce from the square this player occupies, and no Turnover is caused. Instead, this player retains possession of the ball and their activation ends. FAQQ: If a player with the Safe Pass skill and Running Pass skill fumbles a Pass action, does their activation end or can they make use of Running Pass? (p.79)A: Their activation will end. "}, {"name": "Wall Thrower", "content": "(Passing) (Dungeon Bowl) When this player throws the ball at the wall, they may apply an additional +1 modifier when testing for the accuracy of the pass.   STRENGTH    (adsbygoogle=window.adsbygoogle||[]).push({})"}, {"name": "Arm Bar", "content": "(Strength) If an opposition player Falls Over as a result of failing their Agility test when attempting to Dodge, Jump or Leap out of a square in which they were being Marked by this player, you may apply a +1 modifier to either the armour roll or Injury roll. This modifier may be applied after the roll has been made and may be applied even if this player is row Prone. If the opposition player was being marked by more than one player with this Skill, only one player may use it. "}, {"name": "Brawler", "content": "(Strength) When this player performs a Block action on its own (but not as part of a Blitz Action), this player may re-roll a single Both Down result. FAQQ: Brawler states that a player can use this skill when making a Block action on its own (but not as part of a Blitz action). Can a player with this skill use it when it has an assist from a friendly player? (p.80)A: Yes. The ‘on its own’ part simply means it can only be used as a regular Block action, and not part of another action that includes a Block (such as a Blitz action).Q: A player with both the Pro skill and Brawler skill performs Block, rolls two Block Dice and rolls Both Down on both dice, can the controlling coach choose to use Brawler on one of the dice, and then subsequently attempt to use Pro on the other dice that has not yet been rerolled? (p.77 & 80)A: Yes, so long as the same dice is not re-rolled more than once. "}, {"name": "Break Tackle", "content": "(Strength) Once during their activation, after making an Agility test in order to Dodge, this player may modify the dice roll by +1 if their Strength characteristic is 4 or less, or by +2 if their Strength characteristic is 5 or more. "}, {"name": "Grab", "content": "(Strength) A player with this skill uses his great strength and prowess to grab his opponent and throw him around. To represent this, only while making a Block Action, if his block results in a push back he may choose any empty square adjacent to his opponent to push back his opponent. When making a Block or Blitz Action, Grab and Side Step will cancel each other out and the standard pushback rules apply. Grab will not work if there are no empty adjacent squares. A player with the Grab skill can never learn or gain the Frenzy skill through any means. Likewise, a player with the Frenzy skill can never learn or gain the Grab skill through any means. FAQQ: Can a player with the Grab skill choose not to use it if they wish? (p.80)A: Yes. Remember that only Skills and Traits marked with an * are compulsory. "}, {"name": "Guard", "content": "(Strength) A player with this skill assists an offensive or defensive block even if he is in another player’s tackle zone. This skill may not be used to assist a foul. FAQQ: Can a player with the Guard skill still provide offensive and defensive assists when they have lost their Tackle Zone? (p.80)A: No.Q: Can the Guard skill be used to provide offensive and defensive assists when a player is performing a Foul action? (p.80)A: Yes. "}, {"name": "Juggernaut", "content": "(Strength) A player with this skill is virtually impossible to stop once he is in motion. If this player takes a Blitz Action, the opposing player may not use his Fend, Stand Firm or Wrestle skills against the Juggernaut player’s blocks. The Juggernaut player may also choose to treat a !Both Down’ result as if a !Pushed’ result has been rolled instead for blocks he makes during a Blitz Action. "}, {"name": "Mighty Blow", "content": "(Strength) Add 1 to any Armour or Injury roll made by a player with this skill when an opponent is Knocked Down by this player during a block. Note that you only modify one of the dice rolls, so if you decide to use Mighty Blow to modify the Armour roll, you may not modify the Injury roll as well. Mighty Blow cannot be used with the Stab or Chainsaw skills. FAQQ: If a player with the Mighty Blow ( +X) skill makes a Block action, and chooses the Both Down result and is Knocked Down themselves, can they still apply the effects of Mighty Blow (+X)? (p.57 & 80)A: No, as when the Armour roll is made for the opposition player, the player with Mighty Blow (+X) is Prone and so cannot use the skill.Q: Can a player with both the Claws and Mighty Blow ( +X) skills use them together to allow them to break an opposition player’s armour on less than 8+ provided by the Claws skill? (p.78 & 80)A: No.Q: If a player has both the Mighty Blow (+X) skill and the Claws trait, they cannot use the Mighty Blow (+X) skill to modify the Armour roll due to Claws, but can they still use it to modify the Injury roll? (p.80)A: Yes.Q: If a player that is performing a Block action against a player with the Mighty Blow (+1) skill rolls the Player Down! result, can the defending player use the Mighty Blow (+1) skill? (p.80)A: No, as the player with the Mighty Blow (+1) skill has not performed the Block action. "}, {"name": "Multiple Block", "content": "(Strength) At the start of a Block Action a player who is adjacent to at least two opponents may choose to throw blocks against two of them. Make each block in turn as normal except that each defender’s strength is increased by 2. The player cannot follow up either block when using this skill, so Multiple Block can be used instead of Frenzy, but both skills cannot be used together. To have the option to throw the second block the player must still be on his feet after the first block. FAQQ: If a player with Multiple Block also has the Grab skill, can they place the second opposition player that they Blocked into the square that was initially occupied by the first opposition player that they Blocked? (p.80)A: No, as both Block actions happen simultaneously.Q: When a player with the Multiple Block skill declares two adjacent opposing players the target of their Block, do both opponents grant defensive assists to each other if there are no other players from the active team marking them? (p.81)A: No. "}, {"name": "Piling On", "content": "(Strength) The player may use this skill after he has made a block as part of one of his Block or Blitz Actions, but only if the Piling On player is currently standing adjacent to the victim and the victim was Knocked Down. You may re-roll the Armour roll or Injury roll for the victim. The Piling On player is Placed Prone in his own square — it is assumed that he rolls back there after flattening his opponent (do not make an Armour roll for him as he has been cushioned by the other player!). Piling On does not cause a turnover unless the Piling On player is carrying the ball. Piling On cannot be used with the Stab or Chainsaw skills. "}, {"name": "Pile Driver", "content": "(Strength) When an opposition player is Knocked Down by this player as the result of a Block action (on its own or as part of a Blitz action), this player may immediately commit a free Foul action against the Knocked Down player. To use this Skill, this player must be Standing after the block dice result has been selected and applied, and must occupy a square adjacent to the Knocked Down player, After using this Skill, this player is Placed Prone and their activation ends immediately. FAQQ: Does the free Foul action from Pile Driver happen before or after making the Armour roll (and potentially an Injury roll) for the player being Knocked Down? (p.80)A: After – so long as the player is still on the pitch of course!Q: The Pile Driver skill states that the player performing the Block action may then perform a ‘free’ Foul action against the Knocked Down player. Does this ‘free’ Foul action mean that it does not count towards the team’s one Foul action per turn, or does it mean that the player can perform this action for free? (p.80)A: This means that the player may perform this action for free. This Skill cannot be used if the team has already used their Foul action for that team turn, and if used will mean that another player cannot also make a Foul action during the same team turn. "}, {"name": "Stand Firm", "content": "(Strength) This player may choose not to be pushed back, either as the result of a Block action made against them or by a chain-push. Using this Skill does not prevent an opposition player with the Frenzy Skill from performing a second Block action if this player is still Standing after the first. "}, {"name": "Strong Arm", "content": "(Strength) This player may apply a +1 modifier to any Passing Ability test rolls they make when performing a Throw Team-mate action. A player that does not have the Throw team-mate trait cannot have this Skill. "}, {"name": "Thick Skull", "content": "(Strength) When an Injury roll is made against this player (even if this player is Prone, Stunned or has lost their Tackle Zone), they can only be KO’d on a roll of 9, and will treat a roll of 8 as stunned result. If this player also has the Stunty trait, they can only be KO’d on a roll of 8, and will treat a roll of 7 as Stunned result. All other results are unaffected.   MUTATION    (adsbygoogle=window.adsbygoogle||[]).push({}) "}, {"name": "Big Hand", "content": "(Mutation) One of the player’s hands has grown monstrously large, yet remained completely functional. The player ignores modifier(s) for enemy tackle zones or Pouring Rain weather when he attempts to pick up the ball. "}, {"name": "Claws", "content": "(Mutation) A player with this skill is blessed with a huge crab-like claw or razor sharp talons that make armour useless. When an opponent is Knocked Down by this player during a block, any Armour roll of 8 or more after modifications automatically breaks armour. FAQQ: Can a player with both the Claws and Mighty Blow ( +X) skills use them together to allow them to break an opposition player’s armour on less than 8+ provided by the Claws skill? (p.78 & 80)A: No.Q: If a player has both the Mighty Blow (+X) skill and the Claws trait, they cannot use the Mighty Blow (+X) skill to modify the Armour roll due to Claws, but can they still use it to modify the Injury roll? (p.80)A: Yes. "}, {"name": "Disturbing Presence", "content": "(Mutation) This player’s presence is very disturbing, whether it is caused by a massive cloud of flies, sprays of soporific musk, an aura of random chaos or intense cold, or a pheromone that causes fear and panic. Regardless of the nature of this mutation, any player must subtract 1 from the D6 when they pass, intercept or catch for each opposing player with Disturbing Presence that is within three squares of them, even if the Disturbing Presence player is Prone or Stunned. "}, {"name": "Extra Arms", "content": "(Mutation) A player with one or more extra arms may add 1 to any attempt to pick up, catch or intercept. "}, {"name": "Foul Appearance", "content": "(Mutation) When an opposition player declares a Block action targeting this player (on its own or as part of a Blitz action), or any Special actions that targets this player, their coach must firs roll a D6, even if this player has lost their Tackle Zone. On a roll of 1, the player cannot perform the declared action and the action is wasted. This Skill may still be used if the player is Prone, Stunned, or has lost their Tackle Zone. FAQQ: If a player with the Foul Appearance skill is chosen as the target of a Blitz action, when do they roll to see if the action is wasted? (p.78)A: As soon as the Blitz action is declared. This will mean that, if they fail, they will lose their entire action and will be unable to make either the Move action or Block action as part of the Blitz action.Q: If a player with a Trait that requires them to roll a dice to see if they can activate normally (such as Bone Head or Unchanneled Fury) and wishes to declare a player with either the Foul Appearance or Dump-off skills as the target of an action, do they roll for their Trait or for the opposing player’s Skill first? (p.78 & 79)A: The player will first nominate the target of their action, then roll for their Trait, and then the opposing player will use their Skill. "}, {"name": "Horns", "content": "(Mutation) A player with Horns may use them to butt an opponent. Horns adds 1 to the player’s Strength for any block(s) he makes during a Blitz Action. "}, {"name": "Iron Hard Skin", "content": "(Mutations) The Claws skill cannot be used when making an armour roll against this player. This Skill may still be used if the player is Prone, Stunned, or has lost their Tackle Zone. FAQQ: If a player with an AV of 8+ (or worse) randomly gains the Iron Hard Skin skill, does this count as them gaining a Skill they cannot use as the Skill will have no effect? (p.74)A: Yes. They may re-roll. "}, {"name": "Monstrous Mouth", "content": "(Mutations) This player may re-roll any failed attempt to catch the ball. In addition, the Strip Ball skill cannot be used against this player. FAQQ: What happens if a player already has the Catch skill or the Monstrous Mouth skill and randomly rolls the other Skill? (p.75 & 78)A: If a player has the Monstrous Mouth skill and subsequently rolls the Catch skill, then they should re-roll. If a player has the Catch skill and subsequently rolls the Monstrous Mouth skill, then they may not re-roll, as the Monstrous Mouth skill provides an additional benefit. "}, {"name": "Prehensile Tail", "content": "(Mutation) When an active opposition player attempts to Dodge, Jump or Leap in order to vacate a square in which they are being Marked by this player, there is an additional -1 modifier applied to the active player’s Agility test. If the opposition player is being Marked by more than one player with this Mutation, only one player may use it. "}, {"name": "Tentacles", "content": "(Mutation) This player can use this Skill when an opposition player they are Marking voluntarily moves out of a square within this player’s Tackle Zone. Roll a D6, adding the ST of this player to the roll and then subtracting the ST of the opposition player. If the result is 6 or higher, or if the roll is a natural 6, the opposition player is held firmly in place and their movement comes to an end. If, however, the result is 5 or lower, or if the roll is a natural 1, this Skill has no further effect. A player may use this Skill any number or times per turn, during either team’s turn. If an opposition player is being Marked by more than one player with this Skill, only one player may use it. "}, {"name": "Two Heads", "content": "(Mutation) This player may apply a +1 modifier to the Agility test when they attempt to Dodge. "}, {"name": "Very Long Legs", "content": "(Mutation) This player may reduce any negative modifier applied to the Agility test when they attempt to Jump over a Prone or Stunned player (or to Leap over an empty square or a square occupied by a Standing player, if this player has the Leap Skill) by 1, to a minimum of -1. Additionally, this player may apply a +2 modifier to any attempts to interfere with a pass they make. Finally this player ignores the Cloud Burster skill.   EXTRAORDINARY    (adsbygoogle=window.adsbygoogle||[]).push({}) "}, {"name": "Always Hungry", "content": "(Extraordinary) If this player wishes to perform a Throw Team-mate action, roll a D6 after they have finished moving, but before they throw their team-mate. On a roll of 2+, continue with the throw as normal. On a roll of 1, this player will attempt to eat their team-mate. Roll another D6: On a roll of 1, the team-mate has been eaten and is immediately removed from the Team Draft list. No apothecary can save them and no Regeneration attempts can be made. If the team-mate was in possession of the ball, it will bounce from the square the player occupies.On a roll of 2+, the team-mate squirms free and the Throw Team-mate action is automatically fumbled, as described on page 53."}, {"name": "Animal Savagery", "content": "(Extraordinary) When this player is activated, even if they are Prone or have lost their Tackle Zone, immediately after declaring the action they will perform but before peforming the action, roll a D6, applying a +2 modifier to the dice roll if you declared the player would perform a Block or Blitz action (or a Special action granted by a Skill or Trait that can be performed instead of a Block action): On a Roll of 1-3, this player lashes out at their team-mates:One Standing team-mate of your choice that is currently adjacent to this player is immediately Knocked Down by this player. This does not cause a Turnover unless the Knocked Down player was in possession of the ball. After making an armour roll (and possible Injury roll) against the Knocked Down player, this player may continue their activation and complete their declared action if able, Note that, if this player has any applicable Skills, the coach of the opposing team may use them when making an Armour roll (and possible Injury roll) against the Knocked Down player.If this player is not currently adjacent to any Standing team-mates, this player’s activation ends immediately. Additionally, this player loses their Tackle Zone until they are next activated.On a roll of 4+, this player continues their activation as normal and completes their declared action. If you declared that this player would perform an action which can only be performed once per team turn and this player’s activation ended before the action could be completed, the action is considered to have been performed and no other player on your team may perform the same action this team turn. FAQQ: If a player with Animal Savagery knocks down a friendly model, are they forced to use Claws, Piledriver, Mighty Blow (X+) (or any other Skills that would affect Armour or Injury rolls), or can they choose not to? (p.81)A: The only Skills the opposing coach may choose for the player with Animal Savagery to use are Claws and Mighty Blow (+X). In this case, treat the Knock Down as being the result of a Block action.Q: If a player with Animal Savagery knocks down a teammate that hasn’t yet activated during that team turn, can the Knocked Down player still activate provided they haven’t been Stunned or removed from the pitch? (p.81)A: Yes.Q: Will a Prone player that fails its roll for Animal Savagery still lash out against a team-mate?A: Yes.Q: If, during a Blitz kick-off event, a player with the Animal Savagery trait knocks down a player on their team as part of the Animal Savagery trait, will that cause the Blitz kick-off event to immediately end? (p.41 & p.81)A: No.Q: If my player with Animal Savagery trait lashes out against my own teammate and also has the Pile Driver skill, is my opponent able to make me perform a foul against my own teammate? (p.81)A: No, they cannot force you to use the Pile Driver skill. "}, {"name": "Animosity", "content": "(Extraordinary) This player is jealous of and dislikes certain other players of their team, as shown in brackets after the name of the Skill on this player’s profile. This may be defined by position or race. For example, a Skaven Thrower on an Underworld Denizens team has Animosity (Underworld Goblin Lineman), meaning they suffer Animosity towards any Underworld Goblin Lineman players on their team, Whereas a Skaven Renegade on a Chaos Renegade team has Animosity (all team-mates), meaning they suffer Animosity towards all of their team-mates equally. When this player wishes to perform a Hand-off action to a team-mate of the type listed, or attempts to perform a Pass action and the target square is occupied by a team-mate of the type listed, this player may refuse to do so. Roll a D6. On a roll of 1, this player refuses to perform the action and their activation comes to an end. Animosity does not extend to Mercenaries or Star Players. FAQQ: Does a player with the Animosity (X) trait make the roll to see whether they can perform a Pass action or Hand-off action to the relevant player at the start of their activation or just before attempting the desired action? (p.81)A: Animosity (X) states when they attempt to perform the action, so the roll will be made immediately before they attempt to perform the action, not at the start of their activation. "}, {"name": "Ball & Chain", "content": "(Extraordinary) When this player is activated, the only action they may perform is a “Ball and Chain Move” special action. There is no limit to how many players with this Trait may perform this Special action each team turn.When this player performs this Special action: Place the Throw-in template over the player, facing towards either End Zone or either sideline as you wish.Roll a D6 and move the player one square in the direction indicated.A player with Ball and Chain automatically passes any Agility tests they may be required to make in order to Dodge, regardless of any modifiers.If this movement takes the player off the pitch, they risk Injury by the crowdIf this movement takes the player into a square in which the ball is placed, the player is considered to have moved involuntary. Therefore, they may not attempt to pick the ball up and the ball will bounce. Repeat this process for each square the player moves.If this player would move into a square that is occupied by a Standing player from either team, they must perform a Block action against that player, following the normal rules, but with the following exceptions: A Ball and Chain player ignores the Foul Appearance SkillA Ball and Chain player must follow-up if they push-back another player. If this player moves into a square that is occupied by a Prone or Stunned player from either team, for any reason, that player is immediately pushed back and an Armour Roll is made against them.This player may Rush. Declare that the player will Rush before placing the Throw-in template and rolling the D6 to determine direction: If this player Rushes into an occupied square, move them as normal and roll a D6:On a roll of 2+, this player moves without mishap.On a roll of 1 (before or after modification), the player Falls Over.If this player Rushes into a square that is occupied by a standing player from either team, roll a D6:On a roll of 2+, this player moves without mishap and will perform a Block action against the player occupying the square as described previously.On a roll of 1 (before or after modification), the player occupying the square is pushed back and this player will Fall Over after moving into the vacated square. If this player ever Falls Over, is Knocked Down or is placed Prone, an Injury roll is immediately made against them (no Armour roll is required), treating a Stunned result as a KO’d result.A player with this Trait cannot also have the Diving Tackle, Frenzy, Grab, Leap, Multiple Block, On the Ball or Shadowing skills. This Trait must still be used if the player is Prone or has lost their Tackle Zone. FAQQ: What assists, if any, does a Ball & Chain player receive when they are forced to Block a friendly player as per the Ball & Chain Move Special action? (p.82)A: None.Q: Does a player with the Ball & Chain trait have to use their full Movement Allowance? (p.82)A: No.Q: If a player with the Ball & Chain trait performs a Block action against a team-mate as a result of the Ball & Chain Move Special action, which coach chooses the result of the Block action? (p.82)A: The coach of the player performing the Block action.Q: If a player with the Ball & Chain trait moves into a square occupied by a Prone or Stunned player, does the resulting Armour roll benefit from the Mighty Blow (+X) skill if applicable? (p.82)No, as in this instance a Block action wasn’t made.Q: Can a player with the Ball and Chain trait declare a Foul action? (p.82)A: No, the only action a player with the Ball and Chain trait can perform is a ‘Ball & Chain Move’ special action.Q: If a player with the Ball and Chain trait rolls the Piledriver skill as a random Skill, can they re-roll it? (p.82)A: Yes.Q: Does a player with Ball and Chain trait generate Star Player Points if they cause a Casualty as part of a Block action performed during a ‘Ball & Chain Move’ Special action? (p.82)A: Yes.Q: Can a player with the Ball & Chain trait use the Brawler skill? (p.82)A: Yes "}, {"name": "Bloodlust", "content": "(Extraordinary) To keep control of their wits, Vampires need a supply of fresh blood. Whenever a player with this Trait activates, after declaring their action, they must roll a D6, adding 1 to the roll if they declared a Block action or a Blitz action. If they roll equal to or higher than the number shown In brackets, they may activate as normal. lf the player rolls lower than the number shown in brackets, or rolls a natural 1,they may contln ue their activation as normal though they may change their declared action to a Move action if they wish. If the player declared an action that can only be perform,ed once per team turn (such as a Blitz action) this wil lstill count as the one of that action for the team turn. At the end of their activation they may bite an adjacent Thrall Lineman teammate (Standing, Prone or Stunned). lf they bite a Thrall, lmmediatly make an injury roll for the Thrall treating any Casualty result as Badlly Hurt; this will not cause a Turnover unless the Thrall was holding the ball. If they do not bite a Thrall far any reason then a Turnover is caused, the player wil I lose their Tackle Zone untiI they are next activation, and will immediately drop the ball if they were holding it. lf the player was in the opposing End Zone, no touchdown is scored. If a player who failed this roll wants to make a Pass action, Hand-off, or score then they must bite a Thrall before they perform the action or score. FAQQ: Does the Running Pass skill allow a player with the Bloodlust (X+) trait to continue moving after biting a Thrall and then performing a Pass? (p.5)A: Yes.Q: If a player with the Bloodlust (X+) trait ends their activation Prone, can they still bite a Thrall? (p.5)A: No. A player with the Bloodlust (X+) trait must be standing in order to bite a Thrall.Q: What happens if a player with the Bloodlust (X+) trait fails the Bloodlust roll and is then placed Prone as a result of the Wrestle skill during a Block action? (p.5)A: Then the player with the Bloodlust (X+) has been unable to bite a Thrall, a Turnover is caused and the Vampire will lose their Tackle Zone until they are next activated.Q: What happens if a player with the Bloodlust (X+) trait fails the Bloodlust roll and is forced to end their activation early? (p.5)A: Then the player with the Bloodlust (X+) trait has been unable to bite a Thrall, Turnover is caused and the Vampire will lose their Tackle Zone until they are next activated and will immediately drop the ball if they were holding it. "}, {"name": "Bombardier", "content": "(Extraordinary) When activated and if they are Standing, this player can perform a “Throw Bomb” Special action. This Special action is neither a Pass action nor a Throw Team-mate action, so does not prevent another player performing one of those actions during the same team turn. However, only a single player with this Trait may perform this Special action each team turn.A Bomb can be thrown and caught, and the throw interfered with, just like a ball, using the rules for Pass action as described on page 48, with the following exceptions: A player may not stand up or move before performing a Throw Bomb action.Bombs do not bounce and can come to rest on the ground in an occupied square. Should a player fail to catch a Bomb, it will come to rest on the ground in the square that player occupies.If a Bomb is fumbled, it will explode immediately in the square occupied by the player attempting to throw it.If a Bomb comes to rest on the ground in an empty square or is caught by an opposite player, no Turnover is caused.A player that is in possession of the ball can still catch a Bomb.Any Skills that can be used when performing a Pass action can also be used when performing a Throw Bomb Special action, with the exception of On the Ball. If a Bomb is caught by a player on either team, roll a D6: On a roll of 4+, the Bomb explodes immediately, as described below.On a roll of 1-3, that player must throw the Bomb again immediately. This throw takes place out of the normal sequence of play. Should a Bomb ever leave the pitch, it explodes in the crowd with no effect (on the game) before the crowd can throw it back. When a Bomb comes to rest on the ground, in either an occupied square, in a square occupied by a player that failed to catch the Bomb or in a square occupid by a Prone or Stunned player, it will explode immediately: If the Bomb explodes in an occupied square, that player is automatically hit by the explosion.Roll a D6 for each player (from either team) that occupies a square adjacet to the one in which the Bomb exploded:On a roll of 4+, the player has been hit by the explosion.On a roll of 1-3, the player manages to avoid the explosion.Any Standing players hit by the explosion are Placed Prone.An Armour roll (and possibly an Injury roll as well) is made against any player hit by the explosion, even if they were already Prone or Stunned.You may apply a +1 modifier to either the Armour roll or Injury roll. This modifier may be applied after the roll been made.If the player performing the Throw Bomb Special action is hit by their bomb and Placed Prone, either as the result of a Fumbled throw or by being hit by the explosion, then a Turnover is caused. FAQQ: If a player Deflects a Bomb, but fails to convert it into an Interception, will it scatter from the square they are in or will they drop it? (p.83)A: It will scatter from the square they are in, in the same manner as a Deflected ball.Q. What happens when the player with Bombardier trait and the Safe Pass skill fumbles a throw when making a Throw Bomb Special Action?A: The bomb will not be dropped and will not explode in the player’s hands. The player’s activation will still end.Q. Can a Player who made a Throw Bomb Special action still use the Running Pass skill to move after throwing the bomb? (p.79 & 83)A: Yes.Q. When using Bombardier trait, can a re-roll be used when determining if a bomb that is caught explodes?A: No.Q: Do Skills that apply to the ball, but are not part of a Pass action (such as Fumblerooskie), also apply to a bomb? (p.83)A: No, because a bomb is not a ball.Q: Can a player use a re-roll of any kind (Team Re-roll, Pro, etc.) to re-roll to see if a bomb that was caught will explode? (p.83)A: No.Q: If a player making a Throw Bomb Special action fumbles the Bomb, does this cause a Turnover? (p.83)A: No. "}, {"name": "Bone Head", "content": "(Extraordinary) When this player is activated, even if they are Prone or have lost their Tackle Zone, immediately after declaring the action they will perform but before performing the action, roll a D6: On a roll of 1, this player forgets what they are doing and their activation ends immediately. Additionally, this player loses their Tackle Zone until they are next activated.On a roll of 2+, this player continues their activation as normal and completes their declared action. If you declared that this player would perform an action which can only be performed once per team turn and this player’s activation ended before the action could be completed, the action is considered to have been performed and no other player on your team may perform the same action this team turn. "}, {"name": "Chainsaw", "content": "(Extraordinary) Instead of performing a Block action (on its own or as part of a Blitz action), this player may perform a “Chainsaw Attack” Special action. Exactly as described for a Block action, nominate a single Standing player to be the target of the Chainsaw Attack Special action, There is no limit to how many players with this Trait may perform this Special action each team turn.To perform a Chainsaw Attack Special action, roll a D6: On a roll of 2+, the nominated target is hit by Chainsaw!On a roll of 1, the Chainsaw will violently ‘kick-back’ and hit the player wielding it. This will result in a Turnover.In either case, an Armour roll is made against the player hit by the Chainsaw, adding +3 to the result.If the armour of the player hit is broken, they become Prone and an Injury roll is made against them. This Injury roll cannot be modified in any way.If the armour of the player hit is not broken, this Trait has no effect This player can only use the Chainsaw once per turn (i.e., Chainsaw cannot be used with Frenzy or Multipe Block) and if used as part of a Blitz action, this player cannot continue moving after using it.If this player Fails Over or is Knocked Down, the opposing coach may add +3 to the Armour roll made against the player.If an opposition player performs a Block action targeting this player and a Player Down! or a POW! result is applied, +3 is added to the Armour roll. If a Both Down result is applied, +3 is added to both Armour rolls.Finally, this player may use their Chainsaw when they perform a Foul action. Roll a D6 for kick-back as described above. Once again, an Armour roll is made against the player hit by the Chainsaw. adding +3 to the score. FAQQ: Can a player with the Chainsaw trait choose to perform a standard Block action instead of a Chainsaw Attack Special action? (p.84)A: Yes.Q: When a player with the Chainsaw trait uses their chainsaw as part of a Foul action, will they still be subjected to the same offensive assists and defensive assists as a normal Foul action? (p.84)A: Yes. "}, {"name": "Decay", "content": "(Extraordinary) If this player suffers a Casualty result on the injury table, there is a +1 modifier applied to all rolls made against this player on the Casualty table. "}, {"name": "Drunkard", "content": "(Extraordinary) This player suffers a -1 penality to the dice roll when attempting to Rush. "}, {"name": "Fan Favorite", "content": "(Extraordinary) The fans love seeing this player on the pitch so much that even the opposing fans cheer for your team. For each player with Fan Favourite on the pitch your team receives an additional +1 FAME modifier (see page 18) for any Kick-Off table results, but not for the Winnings roll. "}, {"name": "Hit and Run", "content": "(Extraordinary) After a player with this Trait performs a Block action, they may immediately move one free square ignoring Tackle Zones so long as they are still Standing. They must ensure that after this free move, they are not Marked by or Marking any opposition players. FAQQ: Can the Hit and Run trait be used as part of a Blitz action? (p.5)A: Yes, as Hit and Run can be used during a Block action. A Blitz action contains a Block action.Q: Can Hit and Run be used after a Block performed by a player with the Frenzy skill resulting in a Push Back, in order to move away from the targeted player and not perform the second Block? (p.5)A: No. Frenzy requires the player to have to follow up and perform the second Block. Hit and Run may be used after this second Block as normal, if applicable.Q: Does a player with the Hit and Run trait move their one free square before or after following up as part of a Block or Blitz action? (p.5)A: After following up.Q: If a player uses the Hit and Run trait to move out of the Tackle Zone of a player with the Tentacles skill, does the player with Tentacles get to use the Skill? (p.5)A: No. "}, {"name": "Hypnotic Gaze", "content": "(Extraordinary) The player has a powerful telepathic ability that he can use to stun an opponent into immobility. The player may use hypnotic gaze at the end of his Move Action on one opposing player who is in an adjacent square. Make an Agility roll for the player with hypnotic gaze, with a -1 modifier for each opposing tackle zone on the player with hypnotic gaze other than the victim’s. If the Agility roll is successful, then the opposing player loses his tackle zones and may not catch, intercept or pass the ball, assist another player on a block or foul, or move voluntarily until the start of his next Action or the drive ends. If the roll fails, then the hypnotic gaze has no effect. FAQQ: If a model with the Animal Savagery trait wishes to use the Hypnotic Gaze trait, will the bonus +2 to their Animal Savagery roll as if they were performing a Block or a Blitz action? (p.81 & 85)A: No.Q: Can a player with the Hypnotic Gaze trait perform the Hypnotic Gaze Special action in the same activation in which they declared a Block action, Blitz action, Foul action or Pass action? (p.85)A: No. Hypnotic Gaze is a Special action, and therefore must be declared at the start of a player’s activation like all other actions (p.42). The Hypnotic Gaze Special action allows a player to move before they perform the Hypnotic Gaze Special action if they wish.Q: Does a player who has lost their Tackle Zone as a result of the Hypnotic Gaze trait have to drop the ball? (p.85) A: No.Q: Does a player with the Hypnotic Gaze trait, who targets a player with the Foul Appearance skill, need to roll for Foul Appearance before performing the Hypnotic Gaze special action? (p.85)A: Yes.Q: Does a player that declared a Hypnotic Gaze Special action have to declare the target of the Hypnotic Gaze when they are activated before they move? (p.85) A: Yes. "}, {"name": "Kick Team-mate", "content": "(Extraordinary) Once per team turn, in addition to another player performing either a Pass or a Throw Team-mate action, a single player with this Traits on the active team can perform a ‘Kick Team-mate’ Special action, follow the rules for Throw Team-mates actions as described on page 52.However, if the Kick Team-mate Special action is fumbled, the kicked player is automatically removed from play and an injury roll is made against them, treating a Stunned result as a KO’d result (note that, if the player that performed this action also has the Mighty Blow (+x) skill, the coach of the opposing team may use that Skill on this Injury roll). If the kicked player was in possession of the ball when removed from play, the ball will bounce from the square they occupied. FAQQ: If a player makes a superb Kick Team-mate Special action, does it generate Star Player Points like a Throw Team-mate Special action? (p.70)A: No. "}, {"name": "Loner", "content": "(Extraordinary) If this player wishes to use a team re-roll, roll a D6. If you roll equal to or higher than the target number show in brackets, this player may use the team re-roll as normal. Otherwise, the original result stands without being re-rolled but the team re-roll is lost just as if it had been used. This Trait must still be used if the player is Prone or has lost their Tackle Zone. FAQQ: Can a player use a Team re-roll to re-roll a failed Loner (X+) roll? (p.85)A: No. "}, {"name": "My Ball", "content": "(Extraordinary) A player with this Trait may not willingly give up the ball when in possession of it, and so may not make Pass actions, Hand-off actions, or use any other Skill or Trait that would allow them to relinquish possession of the ball. The only way they can lose possession of the ball is by being Knocked Down, Placed Prone, Falling Over or by the effect of a Skill, Trait or special rule of an opposing model. "}, {"name": "No Hands", "content": "(Extraordinary) The player is unable to pick up, intercept or carry the ball and will fail any catch roll automatically, either because he literally has no hands or because his hands are full. If he attempts to pick up the ball then it will bounce, and will cause a turnover if it is his team’s turn. FAQQ: Can a player with the No Hands trait attempt to interfere with a Pass action in order to automatically fail and force the ball to bounce? (p.85)A: No.Q: Can a player with the No Hands trait open a Chest? (p.71, dungeon bowl)A: No. "}, {"name": "Pick-Me-Up", "content": "(Extraordinary) At the end of the opposition’s team turn, roll a D6 for each Prone, non-Stunned team-mate within three squares of a standing player with this Trait. On a 5+, the Prone player may immediately stand up. FAQQ: Does a Prone player on a Norse team roll a D6 for each Beer Boar they are in range of as per the Pick-me-up trait, or only a single D6 regardless of the number of Beer Boars they are in range of? (p.5)A: Just one D6.Q: If a Beer Boar stands up as a result of another Beer Boar’s Pick-me-up trait, can other team-mates now benefit from its own Pick-me-up trait? (p.5)A: No. "}, {"name": "Plague Ridden", "content": "(Extraordinary) Once per game, if an opposition player with Strength characteristic of 4 or less that does not have the Decay, Regeneration or Stunty traits suffers a Casualty result of 15-16, DEAD as the result of a Block action performed or a Foul action committed by a player with this Trait that belongs to your team, and if that player cannot be saved by an apothecary, you may choose to use this Trait. If you do, that player does not die; they have instead been infected with a virulent plague! If your team has the ‘Favoured of Nurgle’ special rule, a new ‘Rotter Lineman’ player, drawn from the Nurgle roster, can be placed immediately in the Reserves box of your team’s dugout (this may cause a team to have more than 16 players for the remainder of this game). During step 4 of the post-game sequence, this player may be permanently hired, Exactly as you would a Journeyman player that had played for your team. "}, {"name": "Pogo Stick", "content": "(Extraordinary) During their movement, instead of jumping over a single square that is occupied by a Prone or Stunned player, as described on page 45, a player with this Trait may choose to Leap over any single adjacent square, including unoccupied square and squares occupied by Standing players. Additionally, when this player makes and Agility test to jump over a Prone or Stunned player, or to Leap over an empty square or a square occupied by a Standing player, they may ignore any negative modifiers that would normally be applied for being Marked in the square they jumped or leaped from and/or for being marked in the square they have jumped or leaped into. A player with this Trait cannot also have the Leap skill. FAQQ: Does a player with the Pogo Stick trait still suffer the -1 modifier to their Agility test when attempting to Leap away from a player with the Prehensile Tail mutation? (p.85)A: No, a player with the Pogo Stick trait ignores all negative modifiers applied for being Marked when attempting to Leap.Q: Does a player with the Pogo Stick trait still suffer the -2 modifier to their Agility test when attempting to Leap away from a player who uses the Diving Tackle skill? (p.85)A: No, a player with the Pogo Stick trait ignores all negative modifiers applied for being Marked when attempting to Leap.Q: If a player with the Leap skill or Pogo Stick trait has used all of their Movement Allowance and is attempting to use the Leap skill or Pogo Stick trait to jump over a square, what happens if they fail the Rush roll? (p.75 & 85)A: If the Rush fails, then the player will fall over in the square they have moved into, do not roll the Agility test for the jumping player. "}, {"name": "Projectile Vomit", "content": "(Extraordinary) Instead of performing a Block action (on its own or as part of a Blitz action), this player may perform a ‘Projectile Vomit’ Special action. Exactly as described for a Block action, nominate a single Standing player to be the target of the Projectile Vomit Special action. There is no limit to how many players with this Trait may perform this Special action each team turn.To perform a Projectile Vomit Special action, roll a D6: On a roll of 2+, this player regurgitates acidic bile onto the nominated target.On a roll of 1, this player belches and snorts, before covering itself in acid bile.In either case, an armour roll is made against the player hit by the Projectile vomit. This Armour roll cannot be modified in any way.If the armour of the player hit is broken, they become Prone and an Injury roll is made against them. This Injury roll cannot be modified in any way.If the armour of the playerhit is not broken, this Trait has no effect. A player can only perform this Special action once per turn (i.e. Projectile Vomit cannot be used with Frenzy or Multiple Block). "}, {"name": "Really Stupid", "content": "(Extraordinary) When this player is activated, even if they are Prone or have lost their Tackle Zone, immediately after declaring the action they will perform but before performing the action, roll a D6, applying a +2 modifier to the dice roll if this player is currently adjacent to one or more Standing team-mates that do not have this Trait: On a roll of 1-3, this player forgets what they are doing and their activation ends immediately. Additionally, this player loses their Tackle Zone until they are next activated.On a roll of 4+, this player continues their activation as normal and completes their declared action. Note that if you declared that this player would perform an action which can only be performed once per team turn and this player’s activation ended before the action could be completed, the action is considered to have been performed and no other player on your team may perform the same action this team turn. "}, {"name": "Regeneration", "content": "(Extraordinary) After a Casualty roll has been made against this player, roll a D6. On a roll of 4+, the Casualty roll is dicarded without effect and the player is placed in the Reserves box rather than the Casualty box of their team dugout. On a roll of 1-3, however, the result of the Casualty roll is applied as normal. This Trait may still be used if the player is Prone, Stunned, or has lost their Tackle Zone. FAQQ: If a player suffers a Casualty, and then rolls a 4+ for their Regeneration trait allowing them not to suffer the Casualty, does the player that inflicted the Casualty still gain Star Player Points for inflicting a Casualty? (p.86)A: Yes.Q: Can a team re-roll be used to re-roll a Regeneration roll under any circumstances? (p.86)A: No. "}, {"name": "Right Stuff", "content": "(Extraordinary) If this player also has a Strength characteristic of 3 or less, they can be thrown by a team-mate with the Throw Team-mate skill, as described on page 52. This Trait may still be used if the player is Prone, Stunned, or has lost their Tackle Zone. "}, {"name": "Secret Weapon", "content": "(Extraordinary) When a drive in which this player took part ends, even if this player was not on the pitch at the end of the drive, this player will be Sent-off for committing a Foul, as described on page 63. FAQQ: The Secret Weapon trait states that at the end of a drive in which they participated they will be Sent-off for committing a Foul. Does this mean that you can Argue the Call in this instance? (p.86)A: Yes.Q: During the End of Drive Sequence, what happens first: players are Sent-off for the Secret Weapon trait, or any end of drive weather effects (such as Sweltering Heat)? (p.66)A: During the End of Drive Sequence, Secret Weapons are always Sent-off before any other effects. "}, {"name": "Stab", "content": "(Extraordinary) Instead of performing a Block action (on its own or as part of a Blitz action), this player may perform a ‘Stab’ Special action. Exactly as described for a Block action, nominate a single Standing player to be the target of the Stab Special action. There is no limit to how many players with this Trait may perform this Special action each team turn.To perform a Stab Special action, make an unmodified Armour roll against the target: If the Armour of the player hit is broken, they become Prone and an Injury roll is made against them, This Injury roll cannot be modified in any way.If the Armour of the player hit is not broken, this Trait has no effect.If Stab is used as part of a Blitz action, the player cannot continue moving after using it. FAQQ. Can the Stab trait be used in conjunction with the Multiple Block skill to make two Stab Special actions?A: Yes.Q: If a player has both the Frenzy skill and the Stab trait, if they declare a Block action which results in a Pushed Back result when they follow up and have to perform a second Block action, can they then use the Stab trait to replace the second Block action with the Stab Special action? (p.77 & 86)A: Yes. "}, {"name": "Stakes", "content": "(Extraordinary) This player is armed with special stakes that are blessed to cause extra damage to the Undead and those that work with them. This player may add 1 to the Armour roll when they make a Stab attack against any player playing for a Khemri, Necromantic, Undead or Vampire team. "}, {"name": "Stunty", "content": "(Extraordinary) When this player makes an Agility test in order to Dodge, they ignore any -1 modifiers for being Marked in the square they have moved into, unless they also have either the Bombardier trait, the Chainsaw trait or the Swoop trait.However, when an opposition player attempts to interfere with a Pass action performed by this player, that player may apply a +1 modifier to their Agility test.Finally, player with this Trait are more prone to injury. Therefore, when an Injury roll is made against this player, roll 2D6 and consult the Stunty Injury table, on page 60. This Trait may still be used if the player is Prone, Stunned, or has lost their Tackle Zone. "}, {"name": "Swarming", "content": "(Extraordinary) During each Start of Drive sequence, after Step 2 but before Step 3, you may remove D3 players with this Trait from the Reserves box of your dugout and set them up on the pitch, allowing you to set up more than the usual 11 players. These extra players may not be placed on the Line of Scrimmage or in a Wide Zone. Swarming players must be set up in their team’s half.When using Swarming, a coach may not set up more players with the Swarming trait onto the pitch than the number of friendly players with the Swarming trait that were already set up. So, if a team had 2 players with the Swarming trait already set up on the pitch, and then rolled for 3 more players to enter the pitch via Swarming, only a maximum of 2 more Swarming players could be set up on the pitch. "}, {"name": "Swoop", "content": "(Extraordinary) If this player is thrown by a team-mate, they do not scatter before landing as they normally would. Instead, you may place the Throw-in template over the player, facing towards either End Zone or either sideline as you wish. The player then moves from the target square D3 squares in a direction determined by rolling a D6 and referring to the Throw-in template. "}, {"name": "Take Root", "content": "(Extraordinary) When this player is activated, even if they are Prone or have lost theio Tackle Zone, immediately after declaring the action they will perform but before performing the action, roll a D6: On a roll of 1, this player becomes ‘Rooted’:A Rooted player cannot move from the square they currently occupy for any reason, voluntarily or otherwise, until the end of this drive, or until they are Knocked Down or Placed Prone.A Rooted player may perform any action available to them provided they can do so without moving. For example, a Rooted player may perform a Pass action but may not move before making the pass, and so on.On a roll of 2+, this player continues their activation as normal. If you declared that this player would perform any action that includes movement (Pass, Hand-off, Blitz or Foul) prior to them becoming Rooted, they may, complete the action if possible. If they cannot, the action is considered to have been performed and no other player on your team may perform the same action this team turn. FAQQ. Can a player that has been Rooted as per the Take Root trait use a skill such as Pile Driver or Wrestle in order to place themselves Prone and therefore no longer be rooted? (p.87)A: Yes.Q: If a player on a portal is Rooted as per the Take Root trait, and then subsequently teleported (such as by a chain reaction), are they still considered to be Rooted? (p.73)A: No. "}, {"name": "Throw Team-Mate", "content": "(Extraordinary) If this player also has a Strength characteristic of 5 or more, they may perform a Throw Team-mate action, as described on page 52, allowing them to throw a team-mate with the Right Stuff trait. FAQQ: If a thrown player lands in an occupied square and then subsequently bounces into another occupied square, is the player that is in the new occupied square also Knocked Down? (p.54)A: Yes.Q: When a Blitz result is rolled on the Kick-off Event table, it states one player may perform a Blitz action and one may perform a Throw Team-mate action. Are these included in the D3+3 players that can be activated, or in addition? (p.41)A: These are included as part of the D3+3.Q: Can any of the Passing skills that are used when performing a Pass action also be used when performing a Throw Team-mate action? (p.79)A: No. "}, {"name": "Timmm-ber!", "content": "(Extraordinary) If the player has a Movement Allowance of 2 or less, apply a +1 modifier to the dice roll when they attempt to stand up (as described on page 44) for each Open, Standing team-mate they are currently adjacent to. A natural 1 is always a failure, no matter how many team-mates are helping. This Trait may still be used if the player is Prone, Stunned, or has lost their Tackle Zone. "}, {"name": "Titchy", "content": "(Extraordinary) This player may apply a +1 modifier to any Agility tests they make in order to Dodge. However, if an opposition player dodges into a square within the Tackle Zone of this player, this player does not count as Marking the moving player for the purpose of calculating Agility test modifiers. "}, {"name": "Trickster", "content": "(Extraordinary) When a player is about to be hit by a Block action or a Special action that replaces a Block action (with the exception of a Block action caused by the Ball & Chain Move Special action), before determinig how many dice are rolled, they may be removed from the pitch ans placed in any other unoccupied square adjacent to the player performing the Block action.. The Block action then takes place as normal. If the player using this Trait is holding the ball and places themselves inthe opposition End Zone, the Block action will still be fully resolved before any touchdown is resolved. "}, {"name": "Unchannelled Fury", "content": "(Extraordinary) When this player is activated, even if they are Prone or have lost their Tackle Zone, immediately after declaring the action they will perform but before performing the action, roll a D6, applying a +2 modifier to the dice roll if you declared the player would perform a Block or Blitz action (or a Special action granted by a Skill or Trait that can be performed instead of a Block action) On a roll of 1-3, this player rages incoherently at others but achieves little else. Their activation ends immediately.On a roll of 4+, this player continues their activation as normal and completes their declared action. If you declared that this player would perform an action which can only be performed once per team turn and this player’s activation ended before the action could be completed, the action is considered to have been performed and no other player on your team may perform the same action this team turn.    (adsbygoogle=window.adsbygoogle||[]).push({})   Take a look to all the teams on Blood Bowl! "}, {"name": "You may Missed", "content": "TeamsKhorne Blood Bowl Team02/07/2024NuffleZone\nTeamsHalflings Blood Bowl Team24/06/2024NuffleZone\nTeamsChaos Chosen Blood Bowl Team02/06/2024NuffleZone\nNews EN TeamsBlood Bowl FAQs28/05/2024NuffleZone"}, {"name": "Khorne Blood Bowl Team", "content": "02/07/2024NuffleZone"}, {"name": "Halflings Blood Bowl Team", "content": "24/06/2024NuffleZone"}, {"name": "Chaos Chosen Blood Bowl Team", "content": "02/06/2024NuffleZone"}, {"name": "Blood Bowl FAQs", "content": "28/05/2024NuffleZone"}]